Revit 2027 API
Tile.TextureScaleLock Property
 The property labeled "Scale Lock" from the "Tile" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string TextureScaleLock { get; }
Public Shared ReadOnly Property TextureScaleLock As String
	Get
public:
static property String^ TextureScaleLock {
	String^ get ();
}
static member TextureScaleLock : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
Tile Class
Autodesk.Revit.DB.Visual Namespace